IRP/src/Catalogs/ObjectStatuses/ObjectStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>ObjectStatuses</name>
 <hierarchical>true</hierarchical>
 <predefined>
  <items>
   <name>SalesOrder</name>
  </items>
  <items>
   <name>SalesReturnOrder</name>
  </items>
  <items>
   <name>PurchaseOrder</name>
  </items>
  <items>
   <name>PurchaseReturnOrder</name>
  </items>
  <items>
   <name>InventoryTransferOrder</name>
  </items>
  <items>
   <name>OutgoingPaymentOrder</name>
  </items>
  <items>
   <name>ReconciliationStatement</name>
  </items>
  <items>
   <name>PhysicalCountByLocation</name>
  </items>
  <items>
   <name>PhysicalInventory</name>
  </items>
  <items>
   <name>IncomingPaymentOrder</name>
  </items>
  <items>
   <name>ChequeBondTransaction</name>
  </items>
  <items>
   <name>WorkOrder</name>
  </items>
  <items>
   <name>ProductionPlanningCorrection</name>
  </items>
 </predefined>
 <attributes>
  <name>SetByDefault</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Posting</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>PostingChequeBondBalance</name>
  <type>
   <types>EnumRef.DocumentPostingTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PostingVendorTransactions</name>
  <type>
   <types>EnumRef.DocumentPostingTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PostingCustomerTransactions</name>
  <type>
   <types>EnumRef.DocumentPostingTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PostingCashPlanning</name>
  <type>
   <types>EnumRef.DocumentPostingTypes</types>
  </type>
 </attributes>
 <tabularSections>
  <name>NextPossibleStatuses</name>
  <attributes>
   <name>Status</name>
   <type>
    <types>CatalogRef.ObjectStatuses</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Users</name>
  <attributes>
   <name>User</name>
   <type>
    <types>CatalogRef.Users</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/ObjectStatuses/Forms/ItemForm/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	LocalizationEvents.CreateMainFormItemDescription(ThisObject, "GroupDescriptions");
	ExtensionServer.AddAttributesFromExtensions(ThisObject, Object.Ref);
	AddAttributesAndPropertiesServer.OnCreateAtServer(ThisObject);
	If Parameters.Key.IsEmpty() Then
		SetVisibilityAvailability(Object, ThisObject);
	EndIf;
EndProcedure

&AtServer
Procedure OnReadAtServer(CurrentObject)
	SetVisibilityAvailability(Object, ThisObject);
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)
	SetVisibilityAvailability(CurrentObject, ThisObject);
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	AddAttributesAndPropertiesServer.BeforeWriteAtServer(ThisObject, Cancel, CurrentObject, WriteParameters);
EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	If EventName = "UpdateAddAttributeAndPropertySets" Then
		AddAttributesCreateFormControl();
	EndIf;
EndProcedure

&AtClient
Procedure FormSetVisibilityAvailability() Export
	SetVisibilityAvailability(Object, ThisObject);
EndProcedure

&AtClientAtServerNoContext
Procedure SetVisibilityAvailability(Object, Form)
	IsCheque = 
	Object.Parent = PredefinedValue("Catalog.ObjectStatuses.ChequeBondIncoming")
	Or Object.Parent = PredefinedValue("Catalog.ObjectStatuses.ChequeBondOutgoing");
	
	IsProductionPlanningCorrection = Object.Parent = PredefinedValue("Catalog.ObjectStatuses.ProductionPlanningCorrection");
	
	Form.Items.GroupPosting.Visible = IsCheque;
	Form.Items.GroupUsers.Visible = IsProductionPlanningCorrection;
EndProcedure

&AtClient
Procedure DescriptionOpening(Item, StandardProcessing) Export
	LocalizationClient.DescriptionOpening(Object, ThisObject, Item, StandardProcessing);
EndProcedure

&AtClient
Procedure ParentOnChange(Item)
	SetVisibilityAvailability(Object, ThisObject);
EndProcedure

&AtClient
Procedure NextPossibleStatusesStatusStartChoice(Item, ChoiceData, StandardProcessing)
	ObjectStatusesClient.StatusStartChoice(Object, ThisObject, GetArrayOfFilters(), Item, ChoiceData, StandardProcessing);
EndProcedure

&AtClient
Procedure NextPossibleStatusesStatusEditTextChange(Item, Text, StandardProcessing)
	ObjectStatusesClient.StatusEditTextChange(Object, ThisObject, GetArrayOfFilters(), New Structure(), Item, Text, StandardProcessing);
EndProcedure

&AtClient
Function GetArrayOfFilters()
	ArrayOfFilters = New Array();
	ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("Parent"   , Object.Parent, DataCompositionComparisonType.Equal));
	ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("Ref"      , Object.Ref, DataCompositionComparisonType.NotEqual));
	ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("IsFolder" , False, DataCompositionComparisonType.Equal));
	Return ArrayOfFilters;
EndFunction

#Region AddAttributes

&AtClient
Procedure AddAttributeStartChoice(Item, ChoiceData, StandardProcessing) Export
	AddAttributesAndPropertiesClient.AddAttributeStartChoice(ThisObject, Item, StandardProcessing);
EndProcedure

&AtServer
Procedure AddAttributesCreateFormControl()
	AddAttributesAndPropertiesServer.CreateFormControls(ThisObject);
EndProcedure

#EndRegion
